{
  "news": [
    {
      "01-30T12:00": [
        "<b>More peepers!</b> Today <span class=\"blue\">Miss Blue<span> and <span class=\"green\">Mr. Green<span> joined the ranks of open-eyed pups. Both Miss Yellow and Miss White are showing slits, and will likely have fully-opened eyes tomorrow.",
        "Also, the pups are starting to figure out how to use their legs, and are beginning to lift themselves up when moving around. This often results in a lot of silly staggering, and the occasional face-plant.",
        "Finally (what a busy news day!), we are casually using some color-appropriate nicknames for some of the pups. These are not official names, by any means, but they have a little more character.  They include: <span class=\"red\">Big Red</span>, <span class=\"blue\">Blueberry<span>, <span class=\"yellow\">Mellow Yellow<span> (or <span class=\"yellow\">Crazy Daisy<span>), <span class=\"white\">Betty<span> (for Betty White, of course), <span class=\"green\">Green Bean<span>, and <span class=\"purple\">Pixie Plum</span>.  These names are <b>Emily and Johnny Approved&trade;</b>"
      ]
    },
    {
      "01-29T08:00": [
        "<b>Eyes are opening!</b> We were just beginning to see slits yesterday, but as of this morning both <span class=\"red\">Mr. Red’s</span> and <span class=\"purple\">Miss Purple’s</span> eyes are clearly open. Most of the remaining pups are now showing slits, so everybody should have their eyes open soon."
      ]
    },
    {
      "01-27T23:00": [
        "Eagle-eyed viewers may have noticed that the former “Miss Pink” is now called “Miss Purple”. Why? For our initial rickrack collars, we had pink as the sixth color. For the larger velcro collars that the pups are wearing now, we have purple and brown, but no pink… So, purple it is!"
      ]
    },
    {
      "01-27T22:03": [
        "Anticipating “late-breaking news”, like announcing that the puppies eyes have opened, etc. I’m adding a page that lists all the of updates that have been reported. This is data-driven like the puppy weights, so that the latest news can cycle on the main page. <em>(At least, that’s the hope!)</em>"
      ]
    }
  ]
}
