{
  "news": [
    {
      "02-02T22:20": [
        "<strong>Changes, changes, changes!</strong> All of the puppies are getting the hang of using those dangling appendages otherwise known as legs. They are toddling around with much more confidence, and are quite adept at climbing over one another, especially if it means getting a step up to try to escape their containment.",
        "Poor Momma Disa is starting to show signs that nursing is becoming a bit more… abrasive. A few of the puppies are starting to exhibit their first teeth, and <span class=\"blue\">Blueberry</span> already seems to be sprouting fearsome canines! With this in mind, we’ve started to introduce them to their first not-from-momma food source: raw goat’s milk. They still aren’t quite sure what to do with the stuff, whether it’s for stepping in, or for face-planting in… but Barbara has successfully lured them from licking from her finger to lapping from a shallow bowl. We still want them to nurse as long as possible, but it’s a lot for Disa to keep up with feeding six puppies; having a supplemental food source will help everyone.",
        "Big half-brother Gable is trying to get the puppies to play, offering “play bows” and tossing his head. If he only knew what he was in for in another two weeks!",
        "Finally, between increased mobility and learning to eliminate without momma’s help, the puppies have “moved” to a bigger Puppy Condo! Instead of the whelping box, they are now in a configurable enclosure that we will adjust as they grow and develop. This gives them more room to romp and an opportunity to learn how to “keep the den clean” when they need to use the potty."
      ]
    },
    {
      "02-01T12:00": [
        "As of yesterday, <em><strong>all</strong></em> of the puppies have their eyes open.  They are all getting better at using their legs, but still tend to careen around a lot and bump into each other.  On the plus side, it makes for more entertaining PuppyCam watching."
      ]
    },
    {
      "01-30T12:00": [
        "<b>More peepers!</b> Today <span class=\"blue\">Miss Blue</span> and <span class=\"green\">Mr. Green</span> joined the ranks of open-eyed pups. Both <span class=\"yellow\">Miss Yellow</span> and <span class=\"white\">Miss White</span> are showing slits, and will likely have fully-opened eyes tomorrow.",
        "Also, the pups are starting to figure out how to use their legs, and are beginning to lift themselves up when moving around. This often results in a lot of silly staggering, and the occasional face-plant.",
        "Finally <em>(what a busy news day!)</em>, we are casually using some color-appropriate nicknames for some of the pups. These are not official names, by any means, but they have a little more character.  They include: <span class=\"blue\">Blueberry</span>, <span class=\"red\">Big Red</span>, <span class=\"yellow\">Mellow Yellow</span> (or <span class=\"yellow\">Crazy Daisy</span>), <span class=\"white\">Betty</span> (for Betty White, of course!), <span class=\"green\">Jolly Green Giant</span>, and <span class=\"purple\">Pixie Plum</span>.  These names are <b>Emily and Johnny Approved&trade;</b>."
      ]
    },
    {
      "01-29T08:00": [
        "<b>Eyes are opening!</b> We were just beginning to see slits yesterday, but as of this morning both <span class=\"red\">Mr. Red’s</span> and <span class=\"purple\">Miss Purple’s</span> eyes are clearly open. Most of the remaining pups are now showing slits, so everybody should have their eyes open soon."
      ]
    },
    {
      "01-27T23:00": [
        "Eagle-eyed viewers may have noticed that the former <span class=\"pink\">Miss Pink</span> is now called <span class=\"purple\">Miss Purple</span>. Why? For our initial rickrack collars, we had pink as the sixth color. For the larger velcro collars that the pups are wearing now, we have purple and brown, but no pink… So, purple it is!"
      ]
    },
    {
      "01-27T22:03": [
        "Anticipating “late-breaking news”, like announcing that the puppies eyes have opened, etc. I’m adding a page that lists all the of updates that have been reported. This is data-driven like the puppy weights, so that the latest news can cycle on the main page. <em>(At least, that’s the hope!)</em>"
      ]
    }
  ]
}
